Revit 2027 API
BuiltInFailures.EditingFailures.CannotBorrowBusyContention Property
 Can't obtain permission to edit the element. The Central Model is busy.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotBorrowBusyContention { get; }
Public Shared ReadOnly Property CannotBorrowBusyContention As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotBorrowBusyContention {
	FailureDefinitionId^ get ();
}
static member CannotBorrowBusyContention : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace